config.org
#+TITLE: Emacs Config
#+AUTHOR: Andrew Jacobson
#+STARTUP: overview
#+STARTUP: indent
#+LANGUAGE: en

* Personal Deets
In case my emacs gets lost.

#+BEGIN_SRC emacs-lisp
  (setq user-full-name "Andrew Jacobson"
        user-mail-address "andrew.isaac.jacobson@gmail.com")
#+END_SRC
* Custom File
Load auto-generated =custom.el= file from the dotemacs dir.

#+BEGIN_SRC emacs-lisp
  (setq custom-file (expand-file-name "custom.el" user-emacs-directory))
  (load custom-file)
#+END_SRC
* Sane Defaults
** Form
*** UTF-8
UTF-8. UTF-8, everywhere.

#+BEGIN_SRC emacs-lisp
  (setq locale-coding-system 'utf-8)
  (set-terminal-coding-system 'utf-8)
  (set-keyboard-coding-system 'utf-8)
  (set-selection-coding-system 'utf-8)
  (prefer-coding-system 'utf-8)
#+END_SRC
*** Remove cursor blink
No blink.

#+BEGIN_SRC emacs-lisp
  (blink-cursor-mode -1)
#+END_SRC
*** Tabs
Prevent tab indentation and set default tab-width.

#+BEGIN_SRC emacs-lisp
  (setq-default indent-tabs-mode nil)
  (setq-default tab-width 2)
  (setq-default indicate-empty-lines t)
#+END_SRC
*** Show matching parens
Highlight opening/closing paren when cursor is
on/after opening/closing paren respectively.

#+BEGIN_SRC emacs-lisp
  (show-paren-mode 1)
#+END_SRC
*** Show line and column number
Show the current line and column number in the mode line.

#+BEGIN_SRC emacs-lisp
  (line-number-mode 1)
  (column-number-mode 1)
#+END_SRC
*** Display line numbers
Turn on ~linum-mode~ globally.

#+BEGIN_SRC emacs-lisp
  (global-linum-mode)
#+END_SRC
*** Highlight current line
Highlight the line that the cursor is currently on. But only when
programming.

#+BEGIN_SRC emacs-lisp
  (when window-system
    (add-hook 'prog-mode-hook 'hl-line-mode))
#+END_SRC
*** Disable mouse interface
Disable all mouse interfaces since I never use them, but only for
the GUI version.

#+BEGIN_SRC emacs-lisp
  (when window-system
    (menu-bar-mode -1)
    (tool-bar-mode -1)
    (scroll-bar-mode -1)
    (tooltip-mode -1))
#+END_SRC
*** Disable the default splash screen
This disables the default startup screen. I
am replacing it with =dashboard= later anyway.

#+BEGIN_SRC emacs-lisp
  (setq inhibit-startup-message t)
#+END_SRC
** Function
*** Force Save
Force emacs to save the current buffer even when it has not been modified.

#+BEGIN_SRC emacs-lisp
  (defun aj/force-save ()
    (interactive)
    (not-modified 1)
    (save-buffer))

  (bind-key "C-x C-s" 'aj/force-save)
#+END_SRC
*** Require newline at EOF
Add a newline to the end of a file on save.

#+BEGIN_SRC emacs-lisp
  (setq require-final-newline t)
  (setq require-trailing-newline t)
#+END_SRC
*** Allow 'y' or 'n' answers
Typing 'yes' or 'no' is tedious. Tell emacs to allow 'y' and 'n' instead.

#+BEGIN_SRC emacs-lisp
  (defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC
*** Set backup directory
Set backups and auto-save-list directories.

#+BEGIN_SRC emacs-lisp
  (setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
  (setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))
#+END_SRC
*** Delete region when typing
Delete selected region when typing, like you'd expect.

#+BEGIN_SRC emacs-lisp
  (delete-selection-mode 1)
#+END_SRC
*** No bell
Shhhh.

#+BEGIN_SRC emacs-lisp
  (setq visible-bell nil)
  (setq ring-bell-function 'ignore)
#+END_SRC
*** Delete trailing white space on save
Clean up superfluous white space in buffer on save.

#+BEGIN_SRC emacs-lisp
  (add-hook 'before-save-hook 'delete-trailing-whitespace)
#+END_SRC
*** Make it easy to edit this file
Add a function to jump straight to this file.

#+BEGIN_SRC emacs-lisp
  (defun aj/find-config ()
    "Edit `config.org' file"
    (interactive)
    (find-file
     (concat user-emacs-directory "config.org")))

  (bind-key "C-c e" 'aj/find-config)
#+END_SRC
*** Load path
Setup ~load-path~.

#+BEGIN_SRC emacs-lisp
  (let ((default-directory  "~/.emacs.d/lib/"))
    (normal-top-level-add-subdirs-to-load-path))
#+END_SRC
*** Use line wrapping
#+BEGIN_SRC emacs-lisp
  (global-visual-line-mode 1)
#+END_SRC
*** Make C-k kill the whole line
#+BEGIN_SRC emacs-lisp
  (bind-key [remap kill-line] 'kill-whole-line)
#+END_SRC
* Theme
The most important piece of any editor configuration: A good dark theme.
I like the ~gruvbox~ themes.

#+BEGIN_SRC emacs-lisp
  (use-package gruvbox-theme
    :ensure t)

  (load-theme 'gruvbox-dark-hard)
#+END_SRC
* Font
Set emacs default font:

#+BEGIN_SRC emacs-lisp
  (add-to-list 'default-frame-alist '(font . "Source Code Pro-14"))
  ;; (add-to-list 'default-frame-alist '(font . "Hack-14"))
#+END_SRC

** [[https://adobe-fonts.github.io/source-code-pro/][source-code-pro]]
Install ~source-code-pro~:

#+BEGIN_SRC sh
  brew tap homebrew/cask-fonts
  brew cask install font-source-code-pro
#+END_SRC

** [[https://github.com/ryanoasis/nerd-fonts/tree/master/patched-fonts/Hack][hack]]
Install ~hack~:

#+BEGIN_SRC sh
  brew tap homebrew/cask-fonts
  brew cask install font-hack
#+END_SRC
* Darwin
Settings for MacOS.

#+BEGIN_SRC emacs-lisp
  (when (string-equal system-type 'darwin)
    (setq mac-option-modifier 'alt)
    (setq mac-command-modifier 'meta)
    (setq mac-pass-command-to-system nil)
    (setq dired-use-ls-dired nil)
    (setq ns-use-native-fullscreen nil))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package exec-path-from-shell
    :ensure t
    :config
    (setq exec-path-from-shell-check-startup-files nil)
    (when (string-equal system-type 'darwin)
      (exec-path-from-shell-initialize)))
#+END_SRC
* Modeline
** Packages
*** [[https://github.com/TheBB/spaceline][spaceline]]
While I don't use Spacemacs, its mode line is
pretty nifty and works well with my theme. Let's install
and configure it here.

#+BEGIN_SRC emacs-lisp
  (use-package spaceline
    :ensure t
    :config
    (require 'spaceline-config)
    (setq spaceline-buffer-encoding-abbrev-p nil)
    (setq powerline-default-separator nil)
    (spaceline-emacs-theme))
#+END_SRC
*** [[https://github.com/lunaryorn/fancy-battery.el][fancy-battery]]
=fancy-battery= is a nice package that shows the
remaining battery usage time. We'll use it when we
are in GUI emacs. Otherwise, we will use the built-in
battery mode.

#+BEGIN_SRC emacs-lisp
  (use-package fancy-battery
    :ensure t
    :config
    (setq fancy-battery-show-percentage t)
    (setq battery-update-interval 15)
    (if window-system
        (fancy-battery-mode 1)
      (display-battery-mode 1)))
#+END_SRC
** Clock
Tell emacs to Use the 24-hour clock and set the format for the
clock display.

#+BEGIN_SRC emacs-lisp
  (setq display-time-24hr-format 1)
  (setq display-time-format "%H:%M - %d %B %Y")
#+END_SRC

Enable the clock in the mode line.

#+BEGIN_SRC emacs-lisp
  (display-time-mode 1)
#+END_SRC
* Keybindings
A place to global keybindings.

#+BEGIN_SRC emacs-lisp
  (bind-key "M-F" 'forward-to-word)
  (bind-key "M-B" 'backward-to-word)
#+END_SRC
* Frames, Windows & Buffers
** Functions
*** kill-focused-buffer
Kill the currently focused buffer.

#+BEGIN_SRC emacs-lisp
  (defun kill-focused-buffer ()
      (interactive)
      (kill-buffer (current-buffer)))

  (bind-key "C-x C-k" 'kill-focused-buffer)
#+END_SRC
*** toggle-window-split
Toggles the direction in which windows are split (horizontal/vertical).

#+BEGIN_SRC emacs-lisp
  (defun toggle-window-split ()
    (interactive)
    (if (= (count-windows) 2)
        (let* ((this-win-buffer (window-buffer))
               (next-win-buffer (window-buffer (next-window)))
               (this-win-edges (window-edges (selected-window)))
               (next-win-edges (window-edges (next-window)))
               (this-win-2nd (not (and (<= (car this-win-edges)
                                           (car next-win-edges))
                                       (<= (cadr this-win-edges)
                                           (cadr next-win-edges)))))
               (splitter
                (if (= (car this-win-edges)
                       (car (window-edges (next-window))))
                    'split-window-horizontally
                  'split-window-vertically)))
          (delete-other-windows)
          (let ((first-win (selected-window)))
            (funcall splitter)
            (if this-win-2nd (other-window 1))
            (set-window-buffer (selected-window) this-win-buffer)
            (set-window-buffer (next-window) next-win-buffer)
            (select-window first-win)
            (if this-win-2nd (other-window 1))))))

  (bind-key "C-M-]" 'toggle-window-split)
#+END_SRC
*** rotate-windows-in-frame
Rotates the windows inside the current frame in a counter-clockwise direction.

#+BEGIN_SRC emacs-lisp
  (defun rotate-windows-in-frame ()
      (interactive)
      (let ((map
             (mapcar
              (lambda (window)
                `(,window
                  ,(window-buffer
                    (next-window window))))
              (window-list))))
        (mapcar
         (lambda (window-to-buffer)
           (let ((window (car window-to-buffer))
                 (buffer (cadr window-to-buffer)))
             (select-window window)
             (switch-to-buffer buffer))) map)))

  (bind-key "C-|" 'rotate-windows-in-frame)
#+END_SRC
** Packages
*** [[https://github.com/abo-abo/ace-window][ace-window]]

#+BEGIN_SRC emacs-lisp
  (use-package ace-window
    :ensure t
    :config
    ;; (set-face-attribute
    ;;  'aw-background-face nil :foreground "gray40")
    ;; (set-face-attribute
    ;;  'aw-leading-char-face nil :height 200)
    ;; i prefer keys on the home row to the default 0-9
    (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
    :bind ("M-o" . ace-window))
#+END_SRC
*** [[https://github.com/cyrus-and/zoom][zoom]]
#+BEGIN_SRC emacs-lisp
  (use-package zoom
    :ensure t
    :config
    (setq zoom-size '(0.618 . 0.618))
    (setq temp-buffer-resize-mode t)
    (zoom-mode 1))
#+END_SRC
*** [[https://github.com/wasamasa/eyebrowse][eyebrowse]]
#+BEGIN_SRC emacs-lisp
  (use-package eyebrowse
    :ensure t
    :config
    (eyebrowse-mode 1))
#+END_SRC
* Files & Directories
** Packages
