config.el
(setq user-full-name "Andrew Jacobson"
      user-mail-address "andrew.isaac.jacobson@gmail.com")

(setq custom-file (expand-file-name "custom.el" user-emacs-directory))
(load custom-file)

(setq locale-coding-system 'utf-8)
(set-terminal-coding-system 'utf-8)
(set-keyboard-coding-system 'utf-8)
(set-selection-coding-system 'utf-8)
(prefer-coding-system 'utf-8)

(blink-cursor-mode -1)

(setq-default indent-tabs-mode nil)
(setq-default tab-width 2)
(setq-default indicate-empty-lines t)

(show-paren-mode 1)

(line-number-mode 1)
(column-number-mode 1)

(global-linum-mode)

(when window-system
  (add-hook 'prog-mode-hook 'hl-line-mode))

(when window-system
  (menu-bar-mode -1)
  (tool-bar-mode -1)
  (scroll-bar-mode -1)
  (tooltip-mode -1))

(setq inhibit-startup-message t)

(defun aj/force-save ()
  (interactive)
  (not-modified 1)
  (save-buffer))

(bind-key "C-x C-s" 'aj/force-save)

(setq require-final-newline t)
(setq require-trailing-newline t)

(defalias 'yes-or-no-p 'y-or-n-p)

(setq backup-directory-alist '(("." . "~/.emacs.d/backups")))
(setq auto-save-file-name-transforms '((".*" "~/.emacs.d/auto-save-list/" t)))

(delete-selection-mode 1)

(setq visible-bell nil)
(setq ring-bell-function 'ignore)

(add-hook 'before-save-hook 'delete-trailing-whitespace)

(defun aj/find-config ()
  "Edit `config.org' file"
  (interactive)
  (find-file
   (concat user-emacs-directory "config.org")))

(bind-key "C-c e" 'aj/find-config)

(let ((default-directory  "~/.emacs.d/lib/"))
  (normal-top-level-add-subdirs-to-load-path))

(global-visual-line-mode 1)

(bind-key [remap kill-line] 'kill-whole-line)

(use-package gruvbox-theme
  :ensure t)

(load-theme 'gruvbox-dark-hard)

(add-to-list 'default-frame-alist '(font . "Source Code Pro-14"))
;; (add-to-list 'default-frame-alist '(font . "Hack-14"))

(when (string-equal system-type 'darwin)
  (setq mac-option-modifier 'alt)
  (setq mac-command-modifier 'meta)
  (setq mac-pass-command-to-system nil)
  (setq dired-use-ls-dired nil)
  (setq ns-use-native-fullscreen nil))

(use-package exec-path-from-shell
  :ensure t
  :config
  (setq exec-path-from-shell-check-startup-files nil)
  (when (string-equal system-type 'darwin)
    (exec-path-from-shell-initialize)))

(use-package spaceline
  :ensure t
  :config
  (require 'spaceline-config)
  (setq spaceline-buffer-encoding-abbrev-p nil)
  (setq powerline-default-separator nil)
  (spaceline-emacs-theme))

(use-package fancy-battery
  :ensure t
  :config
  (setq fancy-battery-show-percentage t)
  (setq battery-update-interval 15)
  (if window-system
      (fancy-battery-mode 1)
    (display-battery-mode 1)))

(setq display-time-24hr-format 1)
(setq display-time-format "%H:%M - %d %B %Y")

(display-time-mode 1)

(bind-key "M-F" 'forward-to-word)
(bind-key "M-B" 'backward-to-word)

(defun kill-focused-buffer ()
    (interactive)
    (kill-buffer (current-buffer)))

(bind-key "C-x C-k" 'kill-focused-buffer)

(defun toggle-window-split ()
  (interactive)
  (if (= (count-windows) 2)
      (let* ((this-win-buffer (window-buffer))
             (next-win-buffer (window-buffer (next-window)))
             (this-win-edges (window-edges (selected-window)))
             (next-win-edges (window-edges (next-window)))
             (this-win-2nd (not (and (<= (car this-win-edges)
                                         (car next-win-edges))
                                     (<= (cadr this-win-edges)
                                         (cadr next-win-edges)))))
             (splitter
              (if (= (car this-win-edges)
                     (car (window-edges (next-window))))
                  'split-window-horizontally
                'split-window-vertically)))
        (delete-other-windows)
        (let ((first-win (selected-window)))
          (funcall splitter)
          (if this-win-2nd (other-window 1))
          (set-window-buffer (selected-window) this-win-buffer)
          (set-window-buffer (next-window) next-win-buffer)
          (select-window first-win)
          (if this-win-2nd (other-window 1))))))

(bind-key "C-M-]" 'toggle-window-split)

(defun rotate-windows-in-frame ()
    (interactive)
    (let ((map
           (mapcar
            (lambda (window)
              `(,window
                ,(window-buffer
                  (next-window window))))
            (window-list))))
      (mapcar
       (lambda (window-to-buffer)
         (let ((window (car window-to-buffer))
               (buffer (cadr window-to-buffer)))
           (select-window window)
           (switch-to-buffer buffer))) map)))

(bind-key "C-|" 'rotate-windows-in-frame)

(use-package ace-window
  :ensure t
  :config
  ;; (set-face-attribute
  ;;  'aw-background-face nil :foreground "gray40")
  ;; (set-face-attribute
  ;;  'aw-leading-char-face nil :height 200)
  ;; i prefer keys on the home row to the default 0-9
  (setq aw-keys '(?a ?s ?d ?f ?g ?h ?j ?k ?l))
  :bind ("M-o" . ace-window))

(use-package zoom
  :ensure t
  :config
  (setq zoom-size '(0.618 . 0.618))
  (setq temp-buffer-resize-mode t)
  (zoom-mode 1))

(use-package eyebrowse
  :ensure t
  :config
  (eyebrowse-mode 1))
