config.el

(use-package dired
  :bind
  (("C-x C-d" . 'dired-jump)
   :map dired-mode-map
        ("<backspace>" . 'dired-up-directory)))

(use-package dired-efap
  :ensure t
  :config
  (setq dired-efap-initial-filename-selection nil)
  :bind (:map dired-mode-map ("e" . 'dired-efap)))

(use-package fasd
  :ensure
  :bind ("C-c f" . fasd-find-file))

(use-package which-key
  :ensure t
  :config (which-key-mode 1))

(use-package swiper
  :ensure t
  ;; :bind (("C-s" . swiper)
  ;;        ("C-r" . swiper)
  ;;        :map swiper-map
  ;;        ("C-*" . 'swiper-mc)
  ;;        ("C-r" . 'swiper-query-replace))
  :config (setq ivy-height 15))

(use-package hydra
  :ensure t)

(defhydra hydra-ag (:color blue :hint nil)
  "
  _a_: ag              _p_: ag-project-root
  _A_: do-ag           _P_: do-ag-project-root
  _f_: ag-this-file    _b_: ag-buffers
  _F_: do-ag-this-file _B_: do-ag-buffers
"
  ("a" helm-ag)
  ("A" helm-do-ag)
  ("f" helm-ag-this-file)
  ("F" helm-do-ag-this-file)
  ("p" helm-ag-project-root)
  ("P" helm-do-ag-project-root)
  ("b" helm-ag-buffers)
  ("B" helm-do-ag-buffers))

(bind-key "C-c a" 'hydra-ag/body)

(defhydra hydra-avy (:color blue :hint nil)
  "
  _C_: char
  _L_: line
  _S_: symbol
  _W_: word

  _q_: quit
"
  ("C" hydra-avy-char/body)
  ("L" hydra-avy-line/body)
  ("S" hydra-avy-symbol/body)
  ("W" hydra-avy-word/body)
  ("q" nil))

(defhydra hydra-avy-char (:color pink :hint nil)
  "
  _c_: goto-char         _l_: goto-char-in-line
  _2_: goto-char-2       _f_: goto-char-timer
  _p_: goto-char-2-above
  _n_: goto-char-2-below

  _q_: quit
"
  ("c" avy-goto-char)
  ("2" avy-goto-char-2)
  ("p" avy-goto-char-2-above)
  ("n" avy-goto-char-2-below)
  ("l" avy-goto-char-in-line)
  ("f" avy-goto-char-timer)
  ("q" nil))

(defhydra hydra-avy-line (:color pink :hint nil)
  "
  _w_: copy-line           _l_: goto-line
  _k_: kill-ring-save-line _p_: goto-line-above
  _K_: kill-line           _n_: goto-line-below
  _m_: move-line           _e_: goto-end-of-line

  _q_: quit
"
  ("w" avy-copy-line)
  ("k" avy-kill-whole-line)
  ("K" avy-kill-ring-save-whole-line)
  ("m" avy-move-line)
  ("l" avy-goto-line)
  ("p" avy-goto-line-above)
  ("n" avy-goto-line-below)
  ("e" avy-goto-end-of-line)
  ("q" nil))

(defhydra hydra-avy-symbol (:color pink :hint nil)
  "
  _1_: goto-symbol-1
  _p_: goto-symbol-1-above
  _n_: goto-symbol-1-below
"
  ("1" avy-goto-symbol-1)
  ("n" avy-goto-symbol-1-above)
  ("p" avy-goto-symbol-1-below)
  ("q" nil "quit"))

(defhydra hydra-avy-word (:color pink :hint nil)
  "
  _0_: goto-word-0       _P_: goto-word-1-above      _S_: goto-subword-1
  _p_: goto-word-0-above _N_: goto-word-1-below
  _n_: goto-word-0-below _f_: goto-word-or-subword-1
  _1_: goto-word-1       _s_: goto-subword-0

  _q_: quit
"
  ("0" avy-goto-word-0)
  ("p" avy-goto-word-0-above)
  ("n" avy-goto-word-0-below)
  ("1" avy-goto-word-1)
  ("P" avy-goto-word-1-above)
  ("N" avy-goto-word-1-below)
  ("f" avy-goto-word-or-subword-1)
  ("s" avy-goto-subword-0)
  ("S" avy-goto-subword-1)
  ("q" nil))

(bind-key "C-c v" 'hydra-avy/body)

(defhydra hydra-anzu (:color pink :hint nil)
  "
_m_ anzu-mode: %`anzu-mode

_f_: replace-at-cursor-thing _c_: query-replace-at-cursor
_i_: isearch-query-replace   _t_: query-replace-at-cursor-thing
_r_: query-replace
_R_: query-replace-regexp

_q_: quit
"
  ("m" anzu-mode)
  ("f" anzu-replace-at-cursor-thing)
  ("i" anzu-isearch-query-replace)
  ("r" anzu-query-replace)
  ("R" anzu-query-replace-regexp)
  ("c" anzu-query-replace-at-cursor)
  ("t" anzu-query-replace-at-cursor-thing)
  ("q" nil))

(defhydra hydra-help (:color blue :hint nil)
  "
_m_: man           _c_: command     _f_: function
_a_: apropos       _l_: library     _i_: info
_d_: documentation _u_: user-option
_v_: variable      _e_: value

_q_: quit
"
  ("m" man)
  ("a" apropos)
  ("d" apropos-documentation)
  ("v" apropos-variable)
  ("c" apropos-command)
  ("l" apropos-library)
  ("u" apropos-user-option)
  ("e" apropos-value)
  ("f" describe-function)
  ("i" helm-info)
  ("q" nil))

(bind-key "C-c h" 'hydra-help/body)

(defhydra hydra-git (:color blue :hint nil)
  "
_i_: init        _z_: stash
_s_: status      _b_: blame
_l_: log current _t_: git-timemachine
_L_: log other

_q_: quit
"
  ("i" magit-init)
  ("s" magit-status)
  ("l" magit-log-current)
  ("L" magit-log)
  ("z" magit-stash)
  ("b" magit-blame)
  ("t" git-timemachine)
  ("q" nil))

(bind-key "C-c g" 'hydra-git/body)

(defun smart-find-file (arg)
  (interactive "P")
  (if (equal (projectile-project-type) nil)
      (helm-find-files arg)
    (projectile-find-file)))

(defhydra hydra-window (:color red :hint nil)
  "
_o_: ace-window          _0_: delete-window        _h_: windmove-left  _t_: toggle-frame-fullscreen _F_: find-file
_d_: ace-delete-window   _1_: delete-other-windows _l_: windmove-right _b_: ido-switch-buffer
_i_: ace-maximize-window _2_: split-window-below   _j_: windmove-down  _p_: helm-projectile
_s_: ace-swap-window     _3_: split-window-right   _k_: windmove-up    _f_: smart-find-file

_q_: quit
"
  ("o" ace-window)
  ("d" ace-delete-window)
  ("s" ace-swap-window)
  ("i" ace-maximize-window :color blue)
  ("0" delete-window)
  ("1" delete-other-windows :color blue)
  ("2" (lambda ()
         (interactive)
         (split-window-below)
         (windmove-down)))
  ("3" (lambda ()
         (interactive)
         (split-window-right)
         (windmove-right)))
  ("h" windmove-left)
  ("l" windmove-right)
  ("j" windmove-down)
  ("k" windmove-up)
  ("t" toggle-frame-fullscreen)
  ("b" ido-switch-buffer)
  ("p" helm-projectile)
  ("f" smart-find-file)
  ("F" helm-find-files)
  ("q" nil))

(bind-key "C-c w" 'hydra-window/body)

(defhydra hydra-move-dup (:color pink)
  "Move/Dup"
  ("k" md/move-lines-up "move-up")
  ("j" md/move-lines-down "move-down")
  ("p" md/duplicate-up "dup-up")
  ("n" md/duplicate-down "dup-down")
  ("q" nil "quit"))

(bind-key "C-c l" 'hydra-move-dup/body)
