config.org
*** selection
#+BEGIN_SRC emacs-lisp
  (defun hydra-set-mark ()
    (interactive)
    (if (region-active-p)
        (progn
          (deactivate-mark)
          (hydra-keyboard-quit))
      (call-interactively 'set-mark-command)
      (hydra-region/body)))

  (defun unset-mark ()
    (interactive)
    (if (region-active-p)
        (progn
          (deactivate-mark))))

  (defhydra hydra-region (:color pink :hint nil)
    "
  _f_: forward-word  _n_: next-line          _=_: expand-region     _<_: beginning-of-buffer _;_: comment-line
  _b_: backward-word _p_: previous-line      _-_: contract-region   _>_: end-of-buffer
  _F_: forward-sexp  _N_: forward-paragraph  _e_: end-of-line       _w_: copy
  _B_: backward-sexp _P_: backward-paragraph _a_: beginning-of-line _k_: kill

  _M_: multiple-cursors _L_: move-dup _S_: replace-string _R_: replace-regexp

  _q_: quit
  "
    ("f" forward-word)
    ("b" backward-word)
    ("F" forward-sexp)
    ("B" backward-sexp)
    ("n" next-line)
    ("p" previous-line)
    ("N" forward-paragraph)
    ("P" backward-paragraph)
    ("e" end-of-line)
    ("a" beginning-of-line)
    ("=" er/expand-region)
    ("-" er/contract-region)
    ("w" copy-region-as-kill :color blue)
    ("k" kill-region :color blue)
    ("<" beginning-of-buffer)
    (">" end-of-buffer)
    ("M" hydra-multiple-cursors/body :color blue)
    ("L" hydra-move-dup/body :color blue)
    ("S" replace-string :color blue)
    ("R" replace-regexp :color blue)
    (";" comment-line)
    ("q" nil))

  (bind-key "C-SPC" 'hydra-set-mark)
#+END_SRC
*** toggle
#+BEGIN_SRC emacs-lisp
  (defhydra hydra-toggle (:color pink :hint nil)
    "
    _a_ abbrev-mode:       %`abbrev-mode
    _d_ debug-on-error:    %`debug-on-error
    _f_ auto-fill-mode:    %`auto-fill-function
    _h_ highlight          %`highlight-nonselected-windows
    _t_ truncate-lines:    %`truncate-lines
    _w_ whitespace-mode:   %`whitespace-mode
    _l_ org link display:  %`org-descriptive-links
    _r_ rainbow-mode:      %`rainbow-mode

    _q_: quit
    "
    ("a" abbrev-mode)
    ("d" toggle-debug-on-error)
    ("f" auto-fill-mode)
    ("h" (setq highlight-nonselected-windows (not highlight-nonselected-windows)))
    ("t" toggle-truncate-lines)
    ("w" whitespace-mode)
    ("l" org-toggle-link-display)
    ("r" rainbow-mode)
    ("q" nil))

  ;; toggle `whitespace-mode' to inhibit first run error
  (whitespace-mode)
  (whitespace-mode)
  ;; toggle `rainbow-mode' to inhibit first run error
  ;; (rainbow-mode)
  ;; (rainbow-mode)
  (bind-key "C-c t" 'hydra-toggle/body)
#+END_SRC
*** search-and-replace
#+BEGIN_SRC emacs-lisp
  (defhydra hydra-search-and-replace (:color blue :hint nil)
    "
    _a_: anzu           _r_: vr/replace
    _d_: deadgrep       _R_: vr/query-replace
    _i_: symbol-overlay
    _e_: iedit

    _s_: swoop-all
    _p_: swoop-projectile
    _m_: swoop-mode
    _b_: swoop-buffers

    _q_: quit
    "
    ("a" hydra-anzu/body)
    ("d" deadgrep)
    ("i" symbol-overlay-put)
    ("e" iedit-mode)
    ("r" vr/replace)
    ("R" vr/query-replace)
    ("s" helm-multi-swoop-all)
    ("p" helm-multi-swoop-projectile)
    ("m" helm-multi-swoop-current-mode)
    ("b" helm-multi-swoop)
    ("q" nil))

  (bind-key "C-c s" 'hydra-search-and-replace/body)
#+END_SRC
*** multiple-cursors
#+BEGIN_SRC emacs-lisp
  (defhydra hydra-multiple-cursors (:color pink)
    "Multiple Cursors"
    ("a" mc/mark-all-like-this-dwim "mark-all")
    ("n" mc/mark-next-like-this "mark-next")
    ("p" mc/unmark-next-like-this "unmark-next")
    ("q" nil "quit"))

  ;; (bind-key "C-c m" 'hydra-multiple-cursors/body)
#+END_SRC
* Text Editing
** Functions
*** previous-indent-and-open-newline
#+BEGIN_SRC emacs-lisp
  (defun previous-indent-and-open-newline ()
      "Call `indent-and-open-newline' with non-nil PREVIOUS value"
      (interactive)
      (indent-and-open-newline t))

  (bind-key "C-o" 'previous-indent-and-open-newline)
#+END_SRC
*** indent-buffer
#+BEGIN_SRC emacs-lisp
  (defun indent-buffer ()
    "Fix indentation on the entire buffer."
    (interactive)
    (save-excursion
      (indent-region (point-min) (point-max))))

  (bind-key "C-c i" 'indent-buffer)
#+END_SRC
*** indent-and-open-newline
#+BEGIN_SRC emacs-lisp
  (defun indent-and-open-newline (&optional previous)
      "Add a newline after current line and tab to indentation.
      If PREVIOUS is non-nil, go up a line first."
      (interactive)
      (if previous
          (previous-line))
      (end-of-line)
      (newline)
      (indent-for-tab-command))

  (bind-key "C-M-o" 'indent-and-open-newline)
#+END_SRC
** Packages
*** [[https://github.com/syohex/emacs-anzu][anzu]]
#+BEGIN_SRC emacs-lisp
  (use-package anzu
    :ensure t
    :config
    (global-anzu-mode))
#+END_SRC
*** [[https://github.com/abo-abo/avy][avy]]
~avy~ provides a nice jump-to-char mechanic which is
useful for hopping around buffers.

#+BEGIN_SRC emacs-lisp
  (use-package avy
    :ensure t
    :bind
    ("C-:" . 'avy-goto-char)
    ("C-'" . 'avy-goto-char-2)
    ("M-g f" . 'avy-goto-line)
    ("M-g w" . 'avy-goto-word-1)
    ("M-g e" . 'avy-goto-word-0))
#+END_SRC
*** [[https://github.com/magnars/expand-region.el][expand-region]]
From the GitHub page:

/Expand region increases the selected region by semantic units.
Just keep pressing the key until it selects what you want./

#+BEGIN_SRC emacs-lisp
  (use-package expand-region
    :ensure
    :bind ("C-=" . 'er/expand-region))
#+END_SRC
*** [[https://github.com/magnars/multiple-cursors.el][multiple-cursors]]
~multiple-cursors~ let's you have, well, more than 1 cursor.
This is especially useful for making similar multi-line edits
in one go, or for changing the same named symbol in a buffer.

Let's install it and setup some keybindings.

#+BEGIN_SRC emacs-lisp
  (use-package multiple-cursors
    :ensure t
    :bind
    ("C-c C-m" . 'mc/mark-all-dwim)
    ("C-+" . 'mc/mark-next-like-this)
    ("C-_" . 'mc/unmark-next-like-this))
#+END_SRC
*** [[https://github.com/wyuenho/move-dup][move-dup]]
~move-dup~ let's you easily move lines and regions around
inside a buffer. It also makes duplicating single lines up or
down a breeze. Let's install it and add some keybindings.

#+BEGIN_SRC emacs-lisp
  (use-package move-dup
    :ensure t
    :bind
    ("C-S-p" . 'md/move-lines-up)
    ("C-S-n" . 'md/move-lines-down)
    ("M-P" . 'md/duplicate-up)
    ("M-N" . 'md/duplicate-down))
#+END_SRC
*** [[https://github.com/mhayashi1120/Emacs-wgrep][wgrep]]
~wgrep~ is a writable grep buffer, which I mainly use to do
quick text replacement after grepping in a file or project.

#+BEGIN_SRC emacs-lisp
  (use-package wgrep
    :ensure t
    :config (setq wgrep-auto-save-buffer t))
#+END_SRC
*** [[https://github.com/wolray/symbol-overlay][symbol-overlay]]
Install ~symbol-overlay~.

#+BEGIN_SRC emacs-lisp
  (use-package symbol-overlay
    :ensure t)
#+END_SRC
*** [[https://github.com/benma/visual-regexp.el][visual-regexp]]

#+BEGIN_SRC emacs-lisp
  (use-package visual-regexp
    :ensure t)
#+END_SRC
*** [[https://github.com/tsdh/iedit][iedit]]
#+BEGIN_SRC emacs-lisp
  (use-package iedit
    :ensure t)
#+END_SRC
*** [[https://github.com/Wilfred/deadgrep][deadgrep]]
#+BEGIN_SRC emacs-lisp
  (use-package deadgrep
    :ensure t)
#+END_SRC
*** [[https://github.com/mickeynp/smart-scan][smartscan]]
#+BEGIN_SRC emacs-lisp
  (use-package smartscan
    :ensure t
    :config (global-smartscan-mode t))
#+END_SRC
*** smart-indent-rigidly
#+BEGIN_SRC emacs-lisp
  (use-package smart-indent-rigidly
    :ensure t
    :bind (("<C-tab>" . smart-rigid-indent)
           ("<backtab>" . smart-rigid-unindent)))
#+END_SRC
* Project Management
** Packages
*** [[https://github.com/bbatsov/projectile][projectile]]
~projectile~ tracks projects in emacs and allows us to to handy things
like: switching between files in a project or grepping all files within
a project. Very useful. Let's install it now.

#+BEGIN_SRC emacs-lisp
  (use-package projectile
    :ensure t
    :init
    (projectile-global-mode 1)
    :bind (:map projectile-mode-map
                ("C-c p" . 'projectile-command-map)))
#+END_SRC
*** [[https://github.com/bbatsov/helm-projectile][helm-projectile]]
A ~helm~ front-end for ~projectile~, allowing incremental
completion for ~projectile~ commands. Let's install and configure it.

#+BEGIN_SRC emacs-lisp
  (use-package helm-projectile
    :after (projectile)
    :ensure t
    :config
    (setq projectile-completion-system 'helm)
    (helm-projectile-on))
#+END_SRC
* Git
** Packages
*** [[https://github.com/magit/magit][magit]]
~magit~ is the best git front-end. Ever. Plain and simple.

#+BEGIN_SRC emacs-lisp
  (use-package magit
    :ensure t)
#+END_SRC
*** [[https://gitlab.com/pidu/git-timemachine][git-timemachine]]
A neat package that allows you to step forward and backward
in time for the git history of a specific file.

#+BEGIN_SRC emacs-lisp
  (use-package git-timemachine
    :ensure t)
#+END_SRC
* Helm
** [[https://github.com/emacs-helm/helm][helm]]
Install and configure ~helm~.

#+BEGIN_SRC emacs-lisp
  (use-package helm
    :ensure t
    :bind
    ("C-x C-f" . helm-find-files)
    ("C-x C-b" . helm-buffers-list)
    ("M-x"     . helm-M-x)
    ("C-S-y"   . helm-show-kill-ring)
    :config
    (setq helm-split-window-in-side-p nil
          helm-autoresize-max-height 0
          helm-autoresize-min-height 40
          helm-M-x-fuzzy-match t
          helm-buffers-fuzzy-matching t
          helm-recentf-fuzzy-match t
          helm-semantic-fuzzy-match t
          helm-imenu-fuzzy-match t
          helm-echo-input-in-header-line t)
    :init
    (helm-mode 1)
    (helm-autoresize-mode 1)
    :bind (:map helm-map
                ("C-b" . helm-find-files-up-one-level)
                ("C-f" . helm-execute-persistent-action)))
#+END_SRC
