config.org
** [[https://github.com/syohex/emacs-helm-ag][helm-ag]]
Install ~helm-ag~ for use with ~ag~ ([[https://github.com/ggreer/the_silver_searcher][the silerver searcher]]).

#+BEGIN_SRC emacs-lisp
  (use-package helm-ag
    :ensure t
    :after (helm)
    :config
    (setq helm-ag-fuzzy-match t))
#+END_SRC

Install ~ag~.

#+BEGIN_SRC sh
  brew install ag
#+END_SRC
** [[https://github.com/ShingoFukuyama/helm-swoop][helm-swoop]]
#+BEGIN_SRC emacs-lisp
  (use-package helm-swoop
    :bind
    ("C-s" . 'helm-swoop)
    ("C-r" . 'helm-swoop))
#+END_SRC
** [[https://github.com/masasam/emacs-helm-tramp][helm-tramp]]
#+BEGIN_SRC emacs-lisp
  (use-package helm-tramp
    :ensure t
    :bind ("C-c c" . helm-tramp))
#+END_SRC
* Docker
** [[https://github.com/Silex/docker.el][docker]]
#+BEGIN_SRC emacs-lisp
  (use-package docker
    :ensure t
    :bind ("C-c d" . docker))
#+END_SRC
** [[https://github.com/spotify/dockerfile-mode][dockerfile-mode]]
#+BEGIN_SRC emacs-lisp
  (use-package dockerfile-mode
    :ensure t
    :mode (("Dockerfile\\'" . dockerfile-mode)))
#+END_SRC
** [[https://github.com/emacs-pe/docker-tramp.el][docker-tramp]]
#+BEGIN_SRC emacs-lisp
  (use-package docker-tramp
    :ensure t)
#+END_SRC
* Programming
** (L)anguage (S)erver (P)rotocol
*** [[https://github.com/emacs-lsp/lsp-mode][lsp-mode]]
Install and configure ~lsp-mode~.

#+BEGIN_SRC emacs-lisp
  (use-package lsp-mode
    :ensure t
    :commands lsp
    :config (setq lsp-prefer-flymake nil))
#+END_SRC
*** [[https://github.com/emacs-lsp/lsp-ui][lsp-ui]]
Install and configure ~lsp-ui~.

#+BEGIN_SRC emacs-lisp
  (use-package lsp-ui
    :ensure t
    :after (lsp)
    :commands lsp-ui-mode
    :hook (lsp-mode . lsp-ui-mode)
    :config
    (setq lsp-ui-doc-enable nil
          lsp-ui-peek-enable nil
          lsp-ui-sideline-enable nil
          lsp-ui-imenu-enable nil
          lsp-ui-flycheck-enable t))
#+END_SRC
*** [[https://github.com/tigersoldier/company-lsp][company-lsp]]
Install ~company-lsp~.

#+BEGIN_SRC emacs-lisp
  (use-package company-lsp
    :ensure t)

  (add-hook
   'lsp-mode-hook
   (lambda ()
     (add-to-list 'company-backends 'company-lsp)
     (company-mode 1)))
#+END_SRC
** General
*** [[https://github.com/Fuco1/smartparens][smartparens]]
#+BEGIN_SRC emacs-lisp
  (use-package smartparens
    :ensure t
    :config
    (use-package smartparens-config)
    (smartparens-global-mode 1))
#+END_SRC
*** [[https://github.com/wbolster/emacs-direnv][direnv]]
#+BEGIN_SRC emacs-lisp
  (use-package direnv
    :ensure t
    :config
    (setq direnv-show-paths-in-summary nil)
    (direnv-mode))
#+END_SRC
*** [[https://elpa.gnu.org/packages/rainbow-mode.html][rainbow-mode]]
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-mode
    :ensure t
    :hook
    ((org-mode lisp-interaction-mode) . rainbow-mode))
#+END_SRC
*** [[https://github.com/Fanael/rainbow-delimiters][rainbow-delimiters]]
#+BEGIN_SRC emacs-lisp
  (use-package rainbow-delimiters
    :ensure t
    :hook
    ((lisp-mode emacs-lisp-mode lisp-interaction-mode org-mode) . rainbow-delimiters-mode))
#+END_SRC
*** [[https://github.com/kyagi/shell-pop-el][shell-pop]]
#+BEGIN_SRC emacs-lisp
  (use-package shell-pop
    :ensure t
    :bind (("C-." . shell-pop))
    :config
    (setq shell-pop-shell-type
          (quote ("ansi-term" "*ansi-term*"
                  (lambda nil (ansi-term shell-pop-term-shell)))))
    (setq shell-pop-term-shell "/bin/zsh")
    ;; need to do this manually or not picked up by `shell-pop'
    (shell-pop--set-shell-type 'shell-pop-shell-type shell-pop-shell-type))
#+END_SRC
*** [[https://github.com/pashky/restclient.el][restclient]]
#+BEGIN_SRC emacs-lisp
  (use-package restclient
    :ensure
    :mode (("\\.http\\'" . restclient-mode)))
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (defvar http-buffer "*http*")
  (defvar initial-http-message "# -*- restclient -*-\n#\n\n")

  (defun aj/get-http-buffer-create ()
    (interactive)
    (let ((buf (get-buffer http-buffer)))
      (if (null buf)
          (progn
            (switch-to-buffer-other-window http-buffer)
            (restclient-mode)
            (insert initial-http-message))
        (switch-to-buffer-other-window http-buffer))))
#+END_SRC
** Functions
*** zsh
Run a =zsh= instance.

#+BEGIN_SRC emacs-lisp
  (defun aj/zsh ()
    "Run a `zsh' instance."
    (interactive)
    (ansi-term "/bin/zsh"))

  (bind-key "C-c ." 'aj/zsh)
#+END_SRC
** Completion
*** Company
~company-mode~ is my preferred completion engine. Let's
install it and do some basic configuration.

#+BEGIN_SRC emacs-lisp
  (use-package company
    :ensure t
    :config
    ;; no delay before showing completion candidates
    (setq company-idle-delay 0)
    ;; show completion candidates after 3 chars are typed
    (setq company-minimum-prefix-length 3)
    :bind
    (:map company-active-map
          ("M-n" . nil)
          ("M-p" . nil)
          ("C-n" . 'company-select-next)
          ("C-j" . 'company-select-next)
          ("C-p" . 'company-select-previous)
          ("C-k" . 'company-select-previous)
          ("C-f" . 'company-filter-candidates)))
#+END_SRC
** Linting
*** [[https://github.com/flycheck/flycheck][flycheck]]
Install ~flycheck~.

#+BEGIN_SRC emacs-lisp
  (use-package flycheck
    :ensure t)
#+END_SRC
** Languages
*** C/C++
Basic configuration.

#+BEGIN_SRC emacs-lisp
  (setq c-basic-offset 4)
  (c-set-offset 'substatement-open 0)
  (c-set-offset 'arglist-intro '+)
  (c-set-offset 'arglist-close 0)
#+END_SRC

**** cquery
Install the [[https://github.com/cquery-project/cquery][cquery]] C/C++/Objective-C language server.

#+BEGIN_SRC shell
  git clone --recursive https://github.com/cquery-project/cquery.git
  cd cquery
  git submodule update --init
  mkdir build && cd build
  cmake .. -DCMAKE_BUILD_TYPE=Release -DCMAKE_INSTALL_PREFIX=release -DCMAKE_EXPORT_COMPILE_COMMANDS=YES
  cmake --build .
  cmake --build . --target install
#+END_SRC

Install and configure [[https://github.com/cquery-project/emacs-cquery][emacs-cquery]], an Emacs client application
for the ~cquery~ language server.

#+BEGIN_SRC emacs-lisp
  (use-package cquery
    :ensure t
    :config
    (setq cquery-executable "/usr/local/bin/cquery")
    (setq cquery-extra-init-params '(:index (:comments 2) :cacheFormat "msgpack")))

  (add-hook 'c-mode-hook #'lsp)
  (add-hook 'c++-mode-hook #'lsp)
#+END_SRC
**** [[https://github.com/brotzeit/helm-xref][helm-xref]]
Install and configure ~helm-xref~.

#+BEGIN_SRC emacs-lisp
  (use-package helm-xref
    :ensure t
    :config
    (setq xref-show-xrefs-function 'helm-xref-show-xrefs))
#+END_SRC
**** helm-gtags

#+BEGIN_SRC emacs-lisp
  ;; (use-package helm-gtags
  ;;   :ensure t
  ;;   :config
  ;;   (setq helm-gtags-ignore-case t)
  ;;   (setq helm-gtags-auto-update t)
  ;;   (setq helm-gtags-use-input-at-cursor t)
  ;;   (setq helm-gtags-pulse-at-cursor t)
  ;;   (setq helm-gtags-prefix-key "\C-cj")
  ;;   (setq helm-gtags-suggested-key-mapping t)
  ;;   :hook
  ;;   (dired-mode . helm-gtags-mode)
  ;;   (eshell-mode . helm-gtags-mode)
  ;;   (c-mode . helm-gtags-mode)
  ;;   (c++-mode . helm-gtags-mode)
  ;;   (asm-mode . helm-gtags-mode)
  ;;   :bind (:map helm-gtags-mode-map
  ;;               ("C-c j a" . helm-gtags-tags-in-this-function)
  ;;               ("C-c j j" . helm-gtags-select)
  ;;               ("M-." . helm-gtags-dwim)
  ;;               ("M-," . helm-gtags-pop-stack)
  ;;               ("C-c <" . helm-gtags-previous-history)
  ;;               ("C-c >" . helm-gtags-next-history)))
#+END_SRC
*** Elixir
**** Packages
***** [[https://github.com/tonini/alchemist.el][alchemist]]
~alchemist~ is an IDE-like set of tools built around
Elixir. Let's install it now.

#+BEGIN_SRC emacs-lisp
  (use-package alchemist
    :ensure t
    :init (setq alchemist-key-command-prefix (kbd "C-c ,")))
#+END_SRC
**** Hooks
#+BEGIN_SRC emacs-lisp
  (add-hook
   'elixir-mode-hook
   (lambda ()
     (add-hook 'before-save-hook 'elixir-format nil t)))
#+END_SRC
**** Completion
Enable ~company-mode~ for all Elixir modes.

#+BEGIN_SRC emacs-lisp
  (add-hook 'elixir-mode-hook 'company-mode)
  (add-hook 'alchemist-iex-mode-hook 'company-mode)
#+END_SRC
*** Lisp
**** [[https://github.com/abo-abo/lispy][lispy]]
I'm trying out ~lispy~, a package similar to ~paredit~ but
with short, magical keybindings. Let's install it and enable
it for lisp languages.

#+BEGIN_SRC emacs-lisp
  (use-package lispy
    :ensure t
    :hook
    (lisp-mode . lispy-mode)
    (emacs-lisp-mode . lispy-mode)
    :bind
    (:map lispy-mode-map
          ("`" . 'self-insert-command)
          ("M-o" . 'ace-window)
          ("M-n" . nil)))
#+END_SRC
**** [[https://github.com/slime/slime][slime]]
*(S)uperior (L)isp (I)nteraction (M)ode for (E)macs* is a
collection of handy tools that can be used with a range of
lisp implementations. Let's install it now.

#+BEGIN_SRC emacs-lisp
  (use-package slime
    :ensure t
    :config
    (setq inferior-lisp-program "/usr/local/bin/sbcl")
    (setq slime-contribs '(slime-fancy)))
#+END_SRC
**** Dialects
***** Emacs Lisp (elisp)
****** TODO Snippets
****** Completion
Enable ~company-mode~ for ~emacs-lisp-mode~.

#+BEGIN_SRC emacs-lisp
  (add-hook 'emacs-lisp-mode-hook 'company-mode)
#+END_SRC
****** TODO Linting
***** Common Lisp
****** TODO Snippets
****** Completion
Enable ~company-mode~ for ~lisp-mode~.

#+BEGIN_SRC emacs-lisp
  (add-hook 'lisp-mode-hook 'company-mode)
#+END_SRC
****** TODO Linting
*** TypeScript
**** Packages
***** [[https://github.com/emacs-typescript/typescript.el][typescript-mode]]
The major mode for editing ~typescript~ files.

#+BEGIN_SRC emacs-lisp
  (use-package typescript-mode
    :config
    (setq typescript-indent-level 2)
    :ensure t
    :mode (("\\.ts\\'" . typescript-mode)))
#+END_SRC
***** [[https://github.com/ananthakumaran/tide/][tide]]
*(T)ypeScript (I)nteractive (D)evelopment (E)nvironment* or ~tide~
is a set of tools that add IDE-like features for TypeScript
projects. Let's install and configure it now.

#+BEGIN_SRC emacs-lisp
  (use-package tide
    :ensure t
    :after (typescript-mode)
    :hook
    (typescript-mode .
     (lambda ()
       (setq flycheck-check-syntax-automatically '(save mode-enabled))
       (tide-setup)
       (tide-hl-identifier-mode 1)
       (eldoc-mode 1))))
#+END_SRC
**** Linting
#+BEGIN_SRC emacs-lisp
  (add-hook 'typescript-mode-hook 'flycheck-mode)
#+END_SRC
**** Completion
#+BEGIN_SRC emacs-lisp
  (add-hook 'typescript-mode-hook 'company-mode)
#+END_SRC
*** Python
