config.el

(use-package helm-ag
  :ensure t
  :after (helm)
  :config
  (setq helm-ag-fuzzy-match t))

(use-package helm-swoop
  :bind
  ("C-s" . 'helm-swoop)
  ("C-r" . 'helm-swoop))

(use-package helm-tramp
  :ensure t
  :bind ("C-c c" . helm-tramp))

(use-package docker
  :ensure t
  :bind ("C-c d" . docker))

(use-package dockerfile-mode
  :ensure t
  :mode (("Dockerfile\\'" . dockerfile-mode)))

(use-package docker-tramp
  :ensure t)

(use-package lsp-mode
  :ensure t
  :commands lsp
  :config (setq lsp-prefer-flymake nil))

(use-package lsp-ui
  :ensure t
  :after (lsp)
  :commands lsp-ui-mode
  :hook (lsp-mode . lsp-ui-mode)
  :config
  (setq lsp-ui-doc-enable nil
        lsp-ui-peek-enable nil
        lsp-ui-sideline-enable nil
        lsp-ui-imenu-enable nil
        lsp-ui-flycheck-enable t))

(use-package company-lsp
  :ensure t)

(add-hook
 'lsp-mode-hook
 (lambda ()
   (add-to-list 'company-backends 'company-lsp)
   (company-mode 1)))

(use-package smartparens
  :ensure t
  :config
  (use-package smartparens-config)
  (smartparens-global-mode 1))

(use-package direnv
  :ensure t
  :config
  (setq direnv-show-paths-in-summary nil)
  (direnv-mode))

(use-package rainbow-mode
  :ensure t
  :hook
  ((org-mode lisp-interaction-mode typescript-mode) . rainbow-mode))

(use-package rainbow-delimiters
  :ensure t
  :hook
  ((lisp-mode emacs-lisp-mode lisp-interaction-mode org-mode) . rainbow-delimiters-mode))

(use-package shell-pop
  :ensure t
  :bind (("C-." . shell-pop))
  :config
  (setq shell-pop-shell-type
        (quote ("ansi-term" "*ansi-term*"
                (lambda nil (ansi-term shell-pop-term-shell)))))
  (setq shell-pop-term-shell "/bin/zsh")
  ;; need to do this manually or not picked up by `shell-pop'
  (shell-pop--set-shell-type 'shell-pop-shell-type shell-pop-shell-type))

(use-package restclient
  :ensure
  :mode (("\\.http\\'" . restclient-mode)))

(defvar http-buffer "*http*")
(defvar initial-http-message "# -*- restclient -*-\n#\n\n")

(defun aj/get-http-buffer-create ()
  (interactive)
  (let ((buf (get-buffer http-buffer)))
    (if (null buf)
        (progn
          (switch-to-buffer-other-window http-buffer)
          (restclient-mode)
          (insert initial-http-message))
      (switch-to-buffer-other-window http-buffer))))

(defun aj/zsh ()
  "Run a `zsh' instance."
  (interactive)
  (ansi-term "/bin/zsh"))

(bind-key "C-c ." 'aj/zsh)

(use-package company
  :ensure t
  :config
  ;; no delay before showing completion candidates
  (setq company-idle-delay 0)
  ;; show completion candidates after 3 chars are typed
  (setq company-minimum-prefix-length 3)
  :bind
  (("C-c <tab>" . 'company-complete)
   :map company-active-map
   ("M-n"     . nil)
   ("M-p"     . nil)
   ("C-n"     . 'company-select-next)
   ("C-j"     . 'company-select-next)
   ("C-p"     . 'company-select-previous)
   ("C-k"     . 'company-select-previous)
   ("C-f"     . 'company-filter-candidates)))

(use-package flycheck
  :ensure t)

(setq c-basic-offset 4)
(c-set-offset 'substatement-open 0)
(c-set-offset 'arglist-intro '+)
(c-set-offset 'arglist-close 0)

(use-package cquery
  :ensure t
  :config
  (setq cquery-executable "/usr/local/bin/cquery")
  (setq cquery-extra-init-params '(:index (:comments 2) :cacheFormat "msgpack")))

(add-hook 'c-mode-hook #'lsp)
(add-hook 'c++-mode-hook #'lsp)

(use-package helm-xref
  :ensure t
  :config
  (setq xref-show-xrefs-function 'helm-xref-show-xrefs))

;; (use-package helm-gtags
;;   :ensure t
;;   :config
;;   (setq helm-gtags-ignore-case t)
;;   (setq helm-gtags-auto-update t)
;;   (setq helm-gtags-use-input-at-cursor t)
;;   (setq helm-gtags-pulse-at-cursor t)
;;   (setq helm-gtags-prefix-key "\C-cj")
;;   (setq helm-gtags-suggested-key-mapping t)
;;   :hook
;;   (dired-mode . helm-gtags-mode)
;;   (eshell-mode . helm-gtags-mode)
;;   (c-mode . helm-gtags-mode)
;;   (c++-mode . helm-gtags-mode)
;;   (asm-mode . helm-gtags-mode)
;;   :bind (:map helm-gtags-mode-map
;;               ("C-c j a" . helm-gtags-tags-in-this-function)
;;               ("C-c j j" . helm-gtags-select)
;;               ("M-." . helm-gtags-dwim)
;;               ("M-," . helm-gtags-pop-stack)
;;               ("C-c <" . helm-gtags-previous-history)
;;               ("C-c >" . helm-gtags-next-history)))

(use-package alchemist
  :ensure t
  :init (setq alchemist-key-command-prefix (kbd "C-c ,")))

(add-hook
 'elixir-mode-hook
 (lambda ()
   (add-hook 'before-save-hook 'elixir-format nil t)))

(add-hook 'elixir-mode-hook 'company-mode)
(add-hook 'alchemist-iex-mode-hook 'company-mode)

(use-package lispy
  :ensure t
  :hook
  (lisp-mode . lispy-mode)
  (emacs-lisp-mode . lispy-mode)
  :bind
  (:map lispy-mode-map
        ("`" . 'self-insert-command)
        ("M-o" . 'ace-window)
        ("M-n" . nil)))

(use-package slime
  :ensure t
  :config
  (setq inferior-lisp-program "/usr/local/bin/sbcl")
  (setq slime-contribs '(slime-fancy)))

(add-hook 'emacs-lisp-mode-hook 'company-mode)

(add-hook 'lisp-mode-hook 'company-mode)

(use-package typescript-mode
  :config
  (setq typescript-indent-level 2)
  :ensure t
  :mode (("\\.ts\\'" . typescript-mode)))

(use-package tide
  :ensure t
  :after (typescript-mode)
  :hook
  (typescript-mode .
   (lambda ()
     (setq flycheck-check-syntax-automatically '(save mode-enabled))
     (tide-setup)
     (tide-hl-identifier-mode 1)
     (eldoc-mode 1))))

(add-hook 'typescript-mode-hook 'flycheck-mode)

(add-hook 'typescript-mode-hook 'company-mode)
