config.org
**** Packages
[[https://github.com/jorgenschaefer/elpy][elpy]]
#+BEGIN_SRC emacs-lisp
  (use-package elpy
    :ensure t
    :config (elpy-enable))
#+END_SRC
*** JavaScript
**** Packages
***** [[https://github.com/mooz/js2-mode][js2-mode]]
#+BEGIN_SRC emacs-lisp
  (use-package js2-mode
    :ensure t
    :config
    (setq js-indent-level 2)
    :mode (("\\.js\\'" . js2-mode)))
#+END_SRC
***** [[https://github.com/magnars/js2-refactor.el][js2-refactor]]
#+BEGIN_SRC emacs-lisp
  (use-package js2-refactor
    :ensure t
    :hook (js2-mode . js2-refactor-mode)
    :config (js2r-add-keybindings-with-prefix "C-c C-r")
    :bind (:map js2-mode-map
                ("C-k" . 'js2r-kill)))
#+END_SRC
***** [[https://github.com/NicolasPetton/xref-js2][xref-js2]]
#+BEGIN_SRC emacs-lisp
  (use-package xref-js2
    :ensure t
    :bind (:map js2-mode-map
                ("M-." . nil))
    :hook (js2-mode
           . (lambda ()
               (add-hook 'xref-backend-functions #'xref-js2-xref-backend nil t))))
#+END_SRC
***** [[https://github.com/felipeochoa/rjsx-mode/][rjsx-mode]]
Install and configure ~rjsx-mode~.

#+BEGIN_SRC emacs-lisp
  (use-package rjsx-mode
    :ensure t
    :after (js2-mode)
    :mode
    (("\\.js\\'" . rjsx-mode)
     ("\\.jsx\\'" . rjsx-mode)))
#+END_SRC
**** Completion
***** [[https://github.com/proofit404/company-tern][company-tern]]
#+BEGIN_SRC emacs-lisp
  (use-package company-tern
    :ensure t
    :hook (js2-mode .
                    (lambda ()
                      (add-to-list 'company-backends 'company-tern)
                      (company-mode)
                      (tern-mode))))
#+END_SRC

In order for ~tern-mode~ to work, we will also need ~node~ and the ~tern~ ~npm~
package installed.

#+BEGIN_SRC sh
  # install nvm
  curl -o- https://raw.githubusercontent.com/creationix/nvm/v0.34.0/install.sh | bash
  # install latest LTS node version
  nvm install node
  # install tern
  npm install -g tern
#+END_SRC
**** Linting
**** Snippets
*** Markup
Install ~yaml-mode~ for .ya?ml files

#+BEGIN_SRC emacs-lisp
  (use-package yaml-mode
    :ensure t)
#+END_SRC
*** Go
1. Install the [[https://golang.org/dl/][go programming language and tools]]
2. Add ~$GOPATH/bin~ to your ~$PATH~ variable

#+BEGIN_SRC shell
  export $GOPATH="~/go" # or wherever you want go code to live
  export $PATH="$PATH:$GOPATH/bin" $ put go executables on your path
#+END_SRC

Install and configure ~go-mode~.

To use this setup with ~goimports~ we will need to install it
as well.

#+BEGIN_SRC shell
  go get golang.org/x/tools/cmd/goimports
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package go-mode
    :ensure t
    :hook
    (go-mode
     . (lambda ()
         (add-hook 'before-save-hook 'gofmt-before-save)
         (setq gofmt-command "goimports")
         (if (not (string-match "go" compile-command))
             (set (make-local-variable 'compile-command)
                  "go build -v && go test -v && go vet"))))
    :bind (:map go-mode-map
                ("C-c C-c" . compile)
                ("C-c C-p" . recompile)
                ("M-]" . next-error)
                ("M-[" . previous-error)))
#+END_SRC

Install and configure ~go-eldoc~.

#+BEGIN_SRC emacs-lisp
  (use-package go-eldoc
    :ensure t
    :after (go-mode)
    :hook (go-mode . go-eldoc-setup))
#+END_SRC

Install and configure ~company-go~.

~company-go~ uses [[https://github.com/nsf/gocode][gocode]] for completion, so let's
install that first.

#+BEGIN_SRC shell
  go get -u github.com/nsf/gocode
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package company-go
    :ensure t
    :after (go-mode)
    :hook
    (go-mode
     . (lambda ()
         (add-to-list 'company-backends 'company-go)
         (company-mode 1))))
#+END_SRC

Install and configure ~go-guru~.

We will also need to install the ~guru~ golang package.

#+BEGIN_SRC shell
  go get golang.org/x/tools/cmd/guru
#+END_SRC

#+BEGIN_SRC emacs-lisp
  (use-package go-guru
    :ensure t
    :bind (:map go-mode-map
                ("M-." . go-guru-definition)
                ("M-," . pop-tag-mark))
    :hook (go-mode
           . (lambda ()
               (require 'go-guru)
               (go-guru-hl-identifier-mode 1))))
#+END_SRC
*** CSS
Configure ~css-mode~.

#+BEGIN_SRC emacs-lisp
  (use-package css-mode
    :config
    (setq css-indent-offset 2)
    (company-mode 1))
#+END_SRC
*** Web
**** web-mode
Install and configure ~web-mode~.

#+BEGIN_SRC emacs-lisp
  (use-package web-mode
    :ensure t
    :config
    (setq web-mode-code-indent-offset 2)
    (setq web-mode-css-indent-offset 2)
    (setq web-mode-markup-indent-offset 2)
    :init
    (setq-default
     web-mode-comment-formats
     '(("java"       . "/*")
       ("javascript" . "//")
       ("jsx"        . "//")
       ("php"        . "/*")))
    :mode (("\\.tsx\\'" . web-mode))
    :hook
    (web-mode
     . (lambda ()
         (when (string-equal "tsx" (file-name-extension buffer-file-name))
           (if (equal web-mode-content-type "javascript")
               (web-mode-set-content-type "jsx"))
           (tide-setup)
           (flycheck-mode 1)
           (setq flycheck-check-syntax-automatically '(save mode-enabled))
           (tide-hl-identifier-mode 1)
           (eldoc-mode 1)
           (company-mode 1)
           (flycheck-add-mode 'typescript-tslint 'web-mode))
         (setq web-mode-markup-indent-offset 2))))
#+END_SRC
*** Shell
**** Basic Configuration
#+BEGIN_SRC emacs-lisp
  (use-package sh-mode
    :hook
    (sh-mode
     . (lambda ()
       (company-mode 1)))
    :mode (("\\zshrc\\'" . sh-mode)))

  (setq sh-basic-offset 2)
#+END_SRC
* Misc
** irc
#+BEGIN_SRC emacs-lisp
  (defun aj/irc (&optional server port nick)
    "Log into irc server.
    Uses default values for SERVER, PORT and NICK if they are not supplied"
    (interactive)
    (erc
     :server (or server "irc.freenode.net")
     :port   (or port   "6667")
     :nick   (or nick   "andyjac")))

  ;; enable company-mode for erc
  (add-hook 'erc-mode-hook 'company-mode)
#+END_SRC
