config.el

(use-package elpy
  :ensure t
  :config (elpy-enable))

(use-package js2-mode
  :ensure t
  :config
  (setq js-indent-level 2)
  :mode (("\\.js\\'" . js2-mode)))

(use-package js2-refactor
  :ensure t
  :hook (js2-mode . js2-refactor-mode)
  :config (js2r-add-keybindings-with-prefix "C-c C-r")
  :bind (:map js2-mode-map
              ("C-k" . 'js2r-kill)))

(use-package xref-js2
  :ensure t
  :bind (:map js2-mode-map
              ("M-." . nil))
  :hook (js2-mode
         . (lambda ()
             (add-hook 'xref-backend-functions #'xref-js2-xref-backend nil t))))

(use-package rjsx-mode
  :ensure t
  :after (js2-mode)
  :mode
  (("\\.js\\'" . rjsx-mode)
   ("\\.jsx\\'" . rjsx-mode)))

(use-package company-tern
  :ensure t
  :hook (js2-mode .
                  (lambda ()
                    (add-to-list 'company-backends 'company-tern)
                    (company-mode)
                    (tern-mode))))

(use-package yaml-mode
  :ensure t)

(use-package go-mode
  :ensure t
  :hook
  (go-mode
   . (lambda ()
       (add-hook 'before-save-hook 'gofmt-before-save)
       (setq gofmt-command "goimports")
       (if (not (string-match "go" compile-command))
           (set (make-local-variable 'compile-command)
                "go build -v && go test -v && go vet"))))
  :bind (:map go-mode-map
              ("C-c C-c" . compile)
              ("C-c C-p" . recompile)
              ("M-]" . next-error)
              ("M-[" . previous-error)))

(use-package go-eldoc
  :ensure t
  :after (go-mode)
  :hook (go-mode . go-eldoc-setup))

(use-package company-go
  :ensure t
  :after (go-mode)
  :hook
  (go-mode
   . (lambda ()
       (add-to-list 'company-backends 'company-go)
       (company-mode 1))))

(use-package go-guru
  :ensure t
  :bind (:map go-mode-map
              ("M-." . go-guru-definition)
              ("M-," . pop-tag-mark))
  :hook (go-mode
         . (lambda ()
             (require 'go-guru)
             (go-guru-hl-identifier-mode 1))))

(use-package css-mode
  :config
  (setq css-indent-offset 2)
  (company-mode 1))

(use-package web-mode
  :ensure t
  :config
  (setq web-mode-code-indent-offset 2)
  (setq web-mode-css-indent-offset 2)
  (setq web-mode-markup-indent-offset 2)
  :init
  (setq-default
   web-mode-comment-formats
   '(("java"       . "/*")
     ("javascript" . "//")
     ("jsx"        . "//")
     ("php"        . "/*")))
  :mode (("\\.tsx\\'" . web-mode))
  :hook
  (web-mode
   . (lambda ()
       (when (string-equal "tsx" (file-name-extension buffer-file-name))
         (if (equal web-mode-content-type "javascript")
             (web-mode-set-content-type "jsx"))
         (tide-setup)
         (flycheck-mode 1)
         (setq flycheck-check-syntax-automatically '(save mode-enabled))
         (tide-hl-identifier-mode 1)
         (eldoc-mode 1)
         (company-mode 1)
         (flycheck-add-mode 'typescript-tslint 'web-mode))
       (setq web-mode-markup-indent-offset 2))))

(use-package sh-mode
  :hook
  (sh-mode
   . (lambda ()
     (company-mode 1)))
  :mode (("\\zshrc\\'" . sh-mode)))

(setq sh-basic-offset 2)

(defun aj/irc (&optional server port nick)
  "Log into irc server.
  Uses default values for SERVER, PORT and NICK if they are not supplied"
  (interactive)
  (erc
   :server (or server "irc.freenode.net")
   :port   (or port   "6667")
   :nick   (or nick   "andyjac")))

;; enable company-mode for erc
(add-hook 'erc-mode-hook 'company-mode)
